## PANDAS LIBRARY

- It is one of he most important modules of data science
- Used to work with data in form of frames/tables
- Stands for PanelData
- Data Analysis,Manipulation and Cleaning
    - Data Analysis means analysing the data
        - Statistics of the data ,volume of the data etc
    - Data Manpulation means transforming the data from one format to another
        - Merging,Concatenating etc
    - Data Cleaning means removing NULL data
        - Null data means NAN(Not a Number)
        
- Data Structures in pandas
    - Series
        - Sequential Data
    - DataFrame
        - Data in tabular form i.e rows and coloums

In [ ]:
# we can create series using str,tuple,list and dict

In [6]:
import pandas as pd

In [7]:
# with string
st = "I am Rizwan"
pd.Series(st)

0    I am Rizwan
dtype: object

In [10]:
# input and split
li = input("Enter a sentence : ").split()
print(pd.Series(li))

Enter a sentence : hi how are u
0     hi
1    how
2    are
3      u
dtype: object

In [14]:
pd.Series(range(10,30,3))

0    10
1    13
2    16
3    19
4    22
5    25
6    28
dtype: int64

In [13]:
d ={"1":"one",12:13,"tuple":("hi","bye",143),"list":[1,2,3],"rii":[0,1,9]}
pd.Series(d)

1                   one
12                   13
tuple    (hi, bye, 143)
list          [1, 2, 3]
rii           [0, 1, 9]
dtype: object

In [ ]:
d.index

In [19]:
import numpy as np

ar = np.arange(10,41,5)
a = pd.Series(ar)
print(a)

0    10
1    15
2    20
3    25
4    30
5    35
6    40
dtype: int32

In [22]:
a.index

Int64Index([6, 5, 2, 1, 3, 0, 4], dtype='int64')

In [21]:
a.index = [6,5,2,1,3,0,4]

In [24]:
for i in range(len(a)):
    print(a[i])

35
25
20
30
40
15
10

In [25]:
ind = [j for j in range(len(a))]
pd.Series(a,index=ind)

0    35
1    25
2    20
3    30
4    40
5    15
6    10
dtype: int32

In [28]:
di = {"a":1,"b":3,"z":5,"m":6}
pd.Series(di)

a    1
b    3
z    5
m    6
dtype: int64

In [29]:
di = {"a":1,"b":3,"z":5,"m":6}
pd.Series(di,index=input().split())

z a m b

z    5
a    1
m    6
b    3
dtype: int64

In [32]:
di = {"a":1,"b":3,"z":5,"m":6}
b = pd.Series(di)
print(b)
b.index=input().split()
print(di)
print(b)

a    1
b    3
z    5
m    6
dtype: int64
3 1 2 0
{'a': 1, 'b': 3, 'z': 5, 'm': 6}
3    1
1    3
2    5
0    6
dtype: int64

In [34]:
b.index
b

3    1
1    3
2    5
0    6
dtype: int64

In [36]:
b[2:]

2    5
0    6
dtype: int64

## DataFrames

- Data is 2d format

In [42]:
di

{'a': 1, 'b': 3, 'z': 5, 'm': 6}

In [14]:
di3 = pd.DataFrame(d)
di3

     1  12 tuple  list  rii
0  one  13    hi     1    0
1  one  13   bye     2    1
2  one  13   143     3    9

In [47]:
pd.DataFrame(di,b)

   a  b  z  m
1  1  3  5  6
3  1  3  5  6
5  1  3  5  6
6  1  3  5  6

In [5]:
di = {1:[1,6,7],"hola":"Hii","tup":(4,3,3),4:7,100:3}
di

{1: [1, 6, 7], 'hola': 'Hii', 'tup': (4, 3, 3), 4: 7, 100: 3}

In [ ]:
di1=pd.DataFrame(di,index=input().split())
di1

In [8]:
pd.concat([di,d])

NameError: name 'd' is not defined

In [79]:
di

{1: [1, 6, 7], 'hola': 'Hii', 'tup': (4, 3, 3), 4: 7, 100: 3}

In [80]:
d

{'1': 'one',
 12: 13,
 'tuple': ('hi', 'bye', 143),
 'list': [1, 2, 3],
 'rii': [0, 1, 9]}

In [86]:
l = (1,2,3,4,5)

In [93]:
pd.Series(l)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
pd.concat([l,di])

In [95]:
l

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
d1 = {"a":"hero","v":["villan",1],"kgf":[]

In [39]:
import pandas as pd
di2 = pd.DataFrame({"r":[1,2,3,4],"i":[10,13,14,9],"rock":[14,9,3,4]},index=[4,2,6,7])
di2

   r   i  rock
4  1  10    14
2  2  13     9
6  3  14     3
7  4   9     4

In [17]:
di2.join(di3)

   rate  riz    1    12 tuple  list  rii
4     1   10  NaN   NaN   NaN   NaN  NaN
2     2   13  one  13.0   143   3.0  9.0
6     3   14  NaN   NaN   NaN   NaN  NaN
7     4    9  NaN   NaN   NaN   NaN  NaN

In [18]:
di3 = pd.DataFrame(d)
di3

     1  12 tuple  list  rii
0  one  13    hi     1    0
1  one  13   bye     2    1
2  one  13   143     3    9

In [40]:
di4 = pd.DataFrame({"r":[1,2,1,2],"i":[10,45,23,11],"z":["a","g","y","e"]},index=[100,200,300,400])
di4

     r   i  z
100  1  10  a
200  2  45  g
300  1  23  y
400  2  11  e

In [46]:
a2 = di4.merge(di2)
# a2.coloumns=["S","U","P"]
a2

   r   i  z  rock
0  1  10  a    14

In [47]:
di4.merge(di2,on="i")

   r_x   i  z  r_y  rock
0    1  10  a    1    14

In [48]:
di4.merge(di2,on="r")

   r  i_x  z  i_y  rock
0  1   10  a   10    14
1  1   23  y   10    14
2  2   45  g   13     9
3  2   11  e   13     9

In [55]:
dates = pd.date_range("2022-01-01","2022-07-20")
pd.Series(dates)

0     2022-01-01
1     2022-01-02
2     2022-01-03
3     2022-01-04
4     2022-01-05
         ...
196   2022-07-16
197   2022-07-17
198   2022-07-18
199   2022-07-19
200   2022-07-20
Length: 201, dtype: datetime64[ns]

In [63]:
d = pd.date_range("2022-07-20",periods=6)
pd.Series(d)
# d

0   2022-07-20
1   2022-07-21
2   2022-07-22
3   2022-07-23
4   2022-07-24
5   2022-07-25
dtype: datetime64[ns]

In [58]:
temp = [1,4,2,5,6,9]
pd.Series(temp,index=d)

2022-07-20    1
2022-07-21    4
2022-07-22    2
2022-07-23    5
2022-07-24    6
2022-07-25    9
Freq: D, dtype: int64

In [ ]:
d.index[3]

In [67]:
di4.index[2]

300

### WORKING WITH .csv FILE

In [137]:
import pandas as pd
marks = pd.read_csv("rizwan.csv")
marks

  roll    name  maths  dms  os  co
0   A1  Rizwan     91   93  95  80
1   A2     bro     81   93  95  78
2   A3     sai     91   96  95  89
3   A4    ajay     91   73  75  99
4   A5   pavan     91   83  95  80
5   A6    meka     61   93  55  76
6   A7   monav     91   82  95  80
7   A8    rizz     61   93  92  67
8   A9    rock     91   93  35  22
9   B1  pushpa     91   93  90  69

In [85]:
import string
string.ascii_letters
'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'
import random
random.choice(string.ascii_letters)

'd'

In [86]:
dir(pd)

['BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_hashtable',
 '_is_numpy_dev',
 '_lib',
 '_libs',
 '_np_version_under1p17',
 '_np_version_under1p18',
 '_testing',
 '_tslib',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [38]:
marks.sample()

  roll    name  maths  dms  os  co
0   A1  Rizwan     91   93  95   6

In [45]:
marks.sample(3)

  roll    name  maths  dms  os  co
9   B1  pushpa     91   93  95   6
2   A3     sai     91   93  95   6
0   A1  Rizwan     91   93  95   6

In [46]:
marks.head() # first 5 samples

  roll    name  maths  dms  os  co
0   A1  Rizwan     91   93  95   6
1   A2     bro     91   93  95   6
2   A3     sai     91   93  95   6
3   A4    ajay     91   93  95   6
4   A5   pavan     91   93  95   6

In [56]:
marks.tail() # last 5 samples

  roll    name  maths  dms  os  co
5   A6    meka     91   93  95   6
6   A7   monav     91   93  95   6
7   A8    rizz     91   93  95   6
8   A9    rock     91   93  95   6
9   B1  pushpa     91   93  95   6

In [48]:
marks.tail(3)

  roll    name  maths  dms  os  co
7   A8    rizz     91   93  95   6
8   A9    rock     91   93  95   6
9   B1  pushpa     91   93  95   6

In [49]:
marks["roll"]

0    A1
1    A2
2    A3
3    A4
4    A5
5    A6
6    A7
7    A8
8    A9
9    B1
Name: roll, dtype: object

In [57]:
marks[["roll","name","dms"]]

  roll    name  dms
0   A1  Rizwan   93
1   A2     bro   93
2   A3     sai   93
3   A4    ajay   93
4   A5   pavan   93
5   A6    meka   93
6   A7   monav   93
7   A8    rizz   93
8   A9    rock   93
9   B1  pushpa   93

In [61]:
marks[["roll","name"]]

  roll    name
0   A1  Rizwan
1   A2     bro
2   A3     sai
3   A4    ajay
4   A5   pavan
5   A6    meka
6   A7   monav
7   A8    rizz
8   A9    rock
9   B1  pushpa

In [63]:
r1 = pd.read_csv("rizwan.csv",usecols=["name","roll"])
r1

  roll    name
0   A1  Rizwan
1   A2     bro
2   A3     sai
3   A4    ajay
4   A5   pavan
5   A6    meka
6   A7   monav
7   A8    rizz
8   A9    rock
9   B1  pushpa

In [67]:
marks.columns

Index(['roll', 'name', 'maths', 'dms', 'os', 'co'], dtype='object')

In [68]:
marks.index

RangeIndex(start=0, stop=10, step=1)

In [69]:
marks.info

<bound method DataFrame.info of   roll    name  maths  dms  os  co
0   A1  Rizwan     91   93  95   6
1   A2     bro     91   93  95   6
2   A3     sai     91   93  95   6
3   A4    ajay     91   93  95   6
4   A5   pavan     91   93  95   6
5   A6    meka     91   93  95   6
6   A7   monav     91   93  95   6
7   A8    rizz     91   93  95   6
8   A9    rock     91   93  95   6
9   B1  pushpa     91   93  95   6>

In [72]:
marks.describe()

           maths        dms         os         co
count  10.000000  10.000000  10.000000  10.000000
mean   84.000000  89.200000  82.200000  15.000000
std    12.516656   7.345445  21.070253  28.460499
min    61.000000  73.000000  35.000000   6.000000
25%    83.500000  85.500000  78.750000   6.000000
50%    91.000000  93.000000  93.500000   6.000000
75%    91.000000  93.000000  95.000000   6.000000
max    91.000000  96.000000  95.000000  96.000000

In [73]:
marks.dms.value_counts()

93    6
96    1
82    1
83    1
73    1
Name: dms, dtype: int64

In [97]:
sub = ["maths","dms","co"]
for i in sub:
    print(marks[i].value_counts())

91    7
61    2
81    1
Name: maths, dtype: int64
93    6
96    1
82    1
83    1
73    1
Name: dms, dtype: int64
6     9
96    1
Name: co, dtype: int64

In [99]:
marks.sort_values("dms")

  roll    name  maths  dms  os  co
3   A4    ajay     91   73  75   6
6   A7   monav     91   82  95   6
4   A5   pavan     91   83  95   6
0   A1  Rizwan     91   93  95   6
1   A2     bro     81   93  95   6
5   A6    meka     61   93  55   6
7   A8    rizz     61   93  92  96
8   A9    rock     91   93  35   6
9   B1  pushpa     91   93  90   6
2   A3     sai     91   96  95   6

In [101]:
marks.sort_values("os",ascending=False)

  roll    name  maths  dms  os  co
0   A1  Rizwan     91   93  95   6
1   A2     bro     81   93  95   6
2   A3     sai     91   96  95   6
4   A5   pavan     91   83  95   6
6   A7   monav     91   82  95   6
7   A8    rizz     61   93  92  96
9   B1  pushpa     91   93  90   6
3   A4    ajay     91   73  75   6
5   A6    meka     61   93  55   6
8   A9    rock     91   93  35   6

In [104]:
marks["Total"]=100

In [105]:
marks

  roll    name  maths  dms  os  co  Totla  Total
0   A1  Rizwan     91   93  95   6    100    100
1   A2     bro     81   93  95   6    100    100
2   A3     sai     91   96  95   6    100    100
3   A4    ajay     91   73  75   6    100    100
4   A5   pavan     91   83  95   6    100    100
5   A6    meka     61   93  55   6    100    100
6   A7   monav     91   82  95   6    100    100
7   A8    rizz     61   93  92  96    100    100
8   A9    rock     91   93  35   6    100    100
9   B1  pushpa     91   93  90   6    100    100

In [119]:
marks["maths"]

0    91
1    81
2    91
3    91
4    91
5    61
6    91
7    61
8    91
9    91
Name: maths, dtype: int64

In [114]:
marks["maths"].index[8]

8

In [ ]:
marks.Maths.sum()

In [132]:
marks["total"]=marks.sum(1)
marks

  roll    name  maths  dms  os  co  Totla  Total  total
0   A1  Rizwan     91   93  95   6    100    100    485
1   A2     bro     81   93  95   6    100    100    475
2   A3     sai     91   96  95   6    100    100    488
3   A4    ajay     91   73  75   6    100    100    445
4   A5   pavan     91   83  95   6    100    100    475
5   A6    meka     61   93  55   6    100    100    415
6   A7   monav     91   82  95   6    100    100    474
7   A8    rizz     61   93  92  96    100    100    542
8   A9    rock     91   93  35   6    100    100    425
9   B1  pushpa     91   93  90   6    100    100    480

In [133]:
marks.pop("Totla")

0    100
1    100
2    100
3    100
4    100
5    100
6    100
7    100
8    100
9    100
Name: Totla, dtype: int64

In [135]:
marks.pop("Total")

0    100
1    100
2    100
3    100
4    100
5    100
6    100
7    100
8    100
9    100
Name: Total, dtype: int64

In [138]:
marks

  roll    name  maths  dms  os  co
0   A1  Rizwan     91   93  95  80
1   A2     bro     81   93  95  78
2   A3     sai     91   96  95  89
3   A4    ajay     91   73  75  99
4   A5   pavan     91   83  95  80
5   A6    meka     61   93  55  76
6   A7   monav     91   82  95  80
7   A8    rizz     61   93  92  67
8   A9    rock     91   93  35  22
9   B1  pushpa     91   93  90  69

In [142]:
marks["total"]=marks.sum(1)

In [143]:
marks

  roll    name  maths  dms  os  co  total
0   A1  Rizwan     91   93  95  80    359
1   A2     bro     81   93  95  78    347
2   A3     sai     91   96  95  89    371
3   A4    ajay     91   73  75  99    338
4   A5   pavan     91   83  95  80    349
5   A6    meka     61   93  55  76    285
6   A7   monav     91   82  95  80    348
7   A8    rizz     61   93  92  67    313
8   A9    rock     91   93  35  22    241
9   B1  pushpa     91   93  90  69    343

In [144]:
marks.isnull()

    roll   name  maths    dms     os     co  total
0  False  False  False  False  False  False  False
1  False  False  False  False  False  False  False
2  False  False  False  False  False  False  False
3  False  False  False  False  False  False  False
4  False  False  False  False  False  False  False
5  False  False  False  False  False  False  False
6  False  False  False  False  False  False  False
7  False  False  False  False  False  False  False
8  False  False  False  False  False  False  False
9  False  False  False  False  False  False  False

In [145]:
marks.nunique()

roll     10
name     10
maths     3
dms       5
os        6
co        8
total    10
dtype: int64

In [146]:
clean = marks.dropna()

In [147]:
clean

  roll    name  maths  dms  os  co  total
0   A1  Rizwan     91   93  95  80    359
1   A2     bro     81   93  95  78    347
2   A3     sai     91   96  95  89    371
3   A4    ajay     91   73  75  99    338
4   A5   pavan     91   83  95  80    349
5   A6    meka     61   93  55  76    285
6   A7   monav     91   82  95  80    348
7   A8    rizz     61   93  92  67    313
8   A9    rock     91   93  35  22    241
9   B1  pushpa     91   93  90  69    343

In [148]:
marks

  roll    name  maths  dms  os  co  total
0   A1  Rizwan     91   93  95  80    359
1   A2     bro     81   93  95  78    347
2   A3     sai     91   96  95  89    371
3   A4    ajay     91   73  75  99    338
4   A5   pavan     91   83  95  80    349
5   A6    meka     61   93  55  76    285
6   A7   monav     91   82  95  80    348
7   A8    rizz     61   93  92  67    313
8   A9    rock     91   93  35  22    241
9   B1  pushpa     91   93  90  69    343